-- Дано целое число, лежащее в диапазоне от –999 до 999. Вывести строку — словесное описание данного
-- числа вида "отрицательное двузначное число", "нулевое число", "положительное однозначное число" и т.д.
-------------------------------------------------------------------------------------------------------
function Read_number(read)
	Number = nil
	repeat
		 io.write(read)
		local Number = tonumber( io.read())	
        local len = #tostring(math.abs(Number))
	until type(Number) == "number" and Number%1 == 0 and len <4
	return Number
end
-------------------------------------------------------------
do
    
end